; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-10)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 )
(:init
(arm-empty)
(on b1 b6)
(on b2 b8)
(on b3 b5)
(on b4 b7)
(on-table b5)
(on b6 b3)
(on b7 b9)
(on-table b8)
(on-table b9)
(on b10 b1)
(clear b2)
(clear b4)
(clear b10)
)
(:goal
(and
(on b1 b5)
(on b2 b8)
(on b3 b10)
(on b5 b7)
(on b6 b2)
(on b7 b9))
)
)

; plan
1. (unstack b10 b1)
   deleted: (on b10 b1) (clear b10) (arm-empty)
   added: (holding b10) (clear b1)
   goals met: 2 of 6
2. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 6
3. (unstack b1 b6)
   deleted: (on b1 b6) (clear b1) (arm-empty)
   added: (holding b1) (clear b6)
   goals met: 2 of 6
4. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 6
5. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 2 of 6
6. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 3 of 6
7. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 3 of 6
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 6
9. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 3 of 6
10. (stack b3 b10)
   deleted: (clear b10) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b10)
   goals met: 4 of 6
11. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 6
12. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 5 of 6
13. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 6
14. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 6 of 6
